api/app/controllers/favorites_controller.rb

  def index
    @favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def set_favorite
      @favorite = Favorite.find(params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]