api/app/controllers/recipes_controller.rb

   def create

    recipe = Recipe.create(
        user_id: session[:user_id],
        title: params[:title],
        instructions: params[:instructions],
        minutes_to_complete: params[:minutes_to_complete]
    )
---
INSERT INTO "recipes" ("title", "instructions", "minutes_to_complete", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)